Revit 2027 API
AdvancedGlazing.SurfaceAlbedo Property
 The property labeled "Color" from the "AdvancedGlazing" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string SurfaceAlbedo { get; }
Public Shared ReadOnly Property SurfaceAlbedo As String
	Get
public:
static property String^ SurfaceAlbedo {
	String^ get ();
}
static member SurfaceAlbedo : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.
See Also
Reference
AdvancedGlazing Class
Autodesk.Revit.DB.Visual Namespace